app/controllers/trains_controller.rb

SELECT * FROM `trains` WHERE (train_from LIKE '%bu%')
---
	def index
		if params[:search_by] && params[:search_name]
			@trains=Train.find(:all, :conditions=>["#{params[:search_by]} LIKE ?", "%#{params[:search_name]}%"])

INSERT INTO `trains` (`train_name`, `train_from`, `train_to`, `train_dist`, `created_at`, `updated_at`, `train_num`) VALUES('puriokha', 'puri(orisa)', 'okha', 1700, '2012-06-14 07:36:44', '2012-06-14 07:36:44', NULL)
---
	def create
		@train = Train.new(params[:train])
		if @train.save

SELECT * FROM `trains` WHERE (`trains`.`id` = 2)
---
	def edit
		 @train = Train.find(params[:id])

SELECT * FROM `trains` WHERE (`trains`.`id` = 2)
UPDATE `trains` SET `train_name` = 'Bavanagar', `train_from` = 'Kakinada', `train_to` = 'Bavanagar', `train_dist` = 2500, `updated_at` = '2012-06-12 11:22:56' WHERE `id` = 11
---
	def update
		@train = Train.find(params[:id])
		if @train.update_attributes(params[:train])

SELECT * FROM `trains` WHERE (`trains`.`id` = 14)
DELETE FROM `trains` WHERE `id` = 14
---
	def destroy_train
		#render :text=> params.inspect and return false
		 @train = Train.find(params[:id])
		 @train.destroy

SELECT * FROM `trains` WHERE ('%train_from' LIKE '%buv%')
---
	def search
		#render :text=> params.inspect and return false
		@trains=Train.find(:all, :conditions=>["#{params[:search_by]} LIKE ?", "%#{params[:search_name]}%"])

INSERT INTO `accounts` (`user_name`, `user_email`, `user_password`, `mobile`, `created_at`, `updated_at`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`) VALUES('srinadh', 'sri@gmail.com', '123456', 9949994900, '2012-07-02 09:25:43', '2012-07-02 09:25:43', 'image5.jpg', 'image/jpeg', 439175, '2012-07-02 09:25:42')
---
	def create_signup
		@account = Account.new(params[:account])
		if @account.save

SELECT * FROM `accounts` WHERE (`accounts`.`user_name` = 'sdfsdfsd' AND `accounts`.`user_password` = 'sdfsdf') LIMIT 1
---
	def authenticate
		@account = Account.find_by_user_name_and_user_password(params[:user_name],params[:user_password])

SELECT * FROM `accounts` WHERE (`accounts`.`user_name` = 'gowri') LIMIT 1
---
	def myprofile
		@account=Account.find_by_user_name(session[:user_name])